WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetQName_Client_Request-1.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetQName</a:Action>
    <a:MessageID>urn:uuid:1d20d163-06bc-41cb-a813-32441e21b229</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetQName xmlns="http://tempuri.org/">
      <q:inQName xmlns:d26="http://mynamespace/service" xmlns:q="http://tempuri.org/">d26:localname</q:inQName>
    </RetQName>
  </s:Body>
</s:Envelope>